# settings/settings.py


# ===========================
# 📁 Пути к файлам и папкам
# ===========================
class PathSettings:
    # Путь к журналу учета проектов
    PROJECT_LOG = r"\\192.168.1.98\01 табели\02 Журнал\Журнал Учета Документации АДОМАТ.xlsx"

    # Путь к папке проектов в работе
    PROJECT_FOLDER = r"\\192.168.1.98\project"

    # Путь к папке с архивом проектов
    ARCHIVE_FOLDER = r"\\192.168.1.98\03_пароходы_чертежи"


# ===========================
# 📊 Настройки Excel
# ===========================
class ExcelSettings:
    # Лист получения данных с ВД проекта
    SOURCE_SHEET = '03 ВД'

    # Лист для сохранения списка проектов
    PROJECT_SAVE_SHEET = "projects_all"

    # Лист для сохранения списка документов из папки project (активных)
    PROJECT_DOCS_SAVE_SHEET = "projects_docs"

    # Лист для сохранения списка документов из папки архива проектов
    ARCHIVE_DOCS_SAVE_SHEET = "archive_docs"
